Revit 2026 API

# IFCDataAsInteger Method

---

Gets storage value as integer when its PrimitiveType is integer.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int AsInteger()
```
```vb
Public Function AsInteger As Integer
```
```cpp
public:
int AsInteger()
```
```fsharp
member AsInteger : unit -> int
```

#### Return Value

Int32 The int value.

| Exception | Condition |
| --- | --- |
| InapplicableDataException | The primitive type is not integer. |

#### Reference

IFCData Class

Autodesk.Revit.DB.IFC Namespace